MOD = 1_000_000_007

# 1,2,3일때 패턴은 1,2,5
# n을 7이상 그려보면 4,5,6일때 추가되는 패턴 개수가 반복된다.
# 4 이후로는 2,2,4 반복

# dp[i] = dp[i-1] + (dp[i-2]*2) + (dp[i-3]*5) + 계수 2,2,4 무한반복
# dp[i-3] = dp[i-4] + (dp[i-5]*2) + (dp[i-6]*5) + ... 이므로
# dp[i] - dp[i-3] = dp[i-1] + (dp[i-2]*2) + (dp[i-3]*5) + dp[i-4] - dp[i-6] 로 정리
# 따라서 dp[i] = dp[i-1] + (dp[i-2]*2) + (dp[i-3]*6) + dp[i-4] - dp[i-6]

def solution(n):
    dp = [1, 1, 3, 10, 23, 62] + [0]*(100001-6)
    for i in range(4, n+1):
        dp[i] = (dp[i-1] + (dp[i-2]*2) + (dp[i-3]*6) + dp[i-4] - dp[i-6] + MOD) % MOD
    return dp[n]
